In [1]:
import numpy as np
import pandas as pd

### Series

In [2]:
ls = [1,2,3,4,5]
ts = pd.Series(ls)
ts

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
ts = pd.Series(ls, index=['a','b','c','d','e'])
ts

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [4]:
ts['b']

2

In [5]:
ts['e'] = 10

In [6]:
ts

a     1
b     2
c     3
d     4
e    10
dtype: int64

In [7]:
ts[ts>3]

d     4
e    10
dtype: int64

In [8]:
ts*2

a     2
b     4
c     6
d     8
e    20
dtype: int64

In [9]:
ts

a     1
b     2
c     3
d     4
e    10
dtype: int64

In [10]:
ts.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [11]:
ts.values

array([ 1,  2,  3,  4, 10], dtype=int64)

In [12]:
ts.index = ['가','나','다','라','마']

In [13]:
ts

가     1
나     2
다     3
라     4
마    10
dtype: int64

### DataFrame

In [14]:
raw_data= {'first_name':['jason',np.nan, 'tina','jake','amy'],
          'last_name':['miller', np.nan, 'all','miler','coozer'],
          'age':[42, np.nan, 36, 24, 73],
          'sex':['m', np.nan, 'f','m','f'],
          'pretestscore':[4, np.nan, np.nan, 2, 3],
          'posttestscore':[25, np.nan, np.nan, 62, 70]}

In [15]:
# from pandas import DataFrame, Series

In [16]:
df = pd.DataFrame(raw_data)
df

  first_name last_name   age  sex  pretestscore  posttestscore
0      jason    miller  42.0    m           4.0           25.0
1        NaN       NaN   NaN  NaN           NaN            NaN
2       tina       all  36.0    f           NaN            NaN
3       jake     miler  24.0    m           2.0           62.0
4        amy    coozer  73.0    f           3.0           70.0

In [17]:
df1 = pd.DataFrame(raw_data, columns = ['first_name','last_name'])
df1

  first_name last_name
0      jason    miller
1        NaN       NaN
2       tina       all
3       jake     miler
4        amy    coozer

In [18]:
df.columns

Index(['first_name', 'last_name', 'age', 'sex', 'pretestscore',
       'posttestscore'],
      dtype='object')

In [19]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [20]:
df1

  first_name last_name
0      jason    miller
1        NaN       NaN
2       tina       all
3       jake     miler
4        amy    coozer

In [21]:
df1.columns = ['fn','ln']
df1

      fn      ln
0  jason  miller
1    NaN     NaN
2   tina     all
3   jake   miler
4    amy  coozer

In [22]:
df

  first_name last_name   age  sex  pretestscore  posttestscore
0      jason    miller  42.0    m           4.0           25.0
1        NaN       NaN   NaN  NaN           NaN            NaN
2       tina       all  36.0    f           NaN            NaN
3       jake     miler  24.0    m           2.0           62.0
4        amy    coozer  73.0    f           3.0           70.0

In [23]:
df['age']

0    42.0
1     NaN
2    36.0
3    24.0
4    73.0
Name: age, dtype: float64

In [24]:
df['last_name']

0    miller
1       NaN
2       all
3     miler
4    coozer
Name: last_name, dtype: object

In [25]:
df[['first_name','last_name']]

  first_name last_name
0      jason    miller
1        NaN       NaN
2       tina       all
3       jake     miler
4        amy    coozer

In [26]:
df['sex']

0      m
1    NaN
2      f
3      m
4      f
Name: sex, dtype: object

In [27]:
df.sex

0      m
1    NaN
2      f
3      m
4      f
Name: sex, dtype: object

In [28]:
df.first_name

0    jason
1      NaN
2     tina
3     jake
4      amy
Name: first_name, dtype: object

In [29]:
df['first_name']

0    jason
1      NaN
2     tina
3     jake
4      amy
Name: first_name, dtype: object

In [30]:
df

  first_name last_name   age  sex  pretestscore  posttestscore
0      jason    miller  42.0    m           4.0           25.0
1        NaN       NaN   NaN  NaN           NaN            NaN
2       tina       all  36.0    f           NaN            NaN
3       jake     miler  24.0    m           2.0           62.0
4        amy    coozer  73.0    f           3.0           70.0

In [31]:
# dataframe에 row에 접근
# df.loc[인덱스명]
# df.iloc[인덱스순번]

In [32]:
df.index= ['a','b','c','d','e']
df

  first_name last_name   age  sex  pretestscore  posttestscore
a      jason    miller  42.0    m           4.0           25.0
b        NaN       NaN   NaN  NaN           NaN            NaN
c       tina       all  36.0    f           NaN            NaN
d       jake     miler  24.0    m           2.0           62.0
e        amy    coozer  73.0    f           3.0           70.0

In [33]:
df.loc['c']

first_name       tina
last_name         all
age                36
sex                 f
pretestscore      NaN
posttestscore     NaN
Name: c, dtype: object

In [34]:
df.loc[['c','d']]

  first_name last_name   age sex  pretestscore  posttestscore
c       tina       all  36.0   f           NaN            NaN
d       jake     miler  24.0   m           2.0           62.0

In [35]:
df.iloc[2]

first_name       tina
last_name         all
age                36
sex                 f
pretestscore      NaN
posttestscore     NaN
Name: c, dtype: object

In [36]:
df.iloc[[0, 2]]

  first_name last_name   age sex  pretestscore  posttestscore
a      jason    miller  42.0   m           4.0           25.0
c       tina       all  36.0   f           NaN            NaN

In [37]:
df

  first_name last_name   age  sex  pretestscore  posttestscore
a      jason    miller  42.0    m           4.0           25.0
b        NaN       NaN   NaN  NaN           NaN            NaN
c       tina       all  36.0    f           NaN            NaN
d       jake     miler  24.0    m           2.0           62.0
e        amy    coozer  73.0    f           3.0           70.0

In [38]:
df.loc['a', 'last_name']

'miller'

In [39]:
df.iloc[0, 1]

'miller'

In [40]:
df.loc['a':'c', 'last_name':'sex']

  last_name   age  sex
a    miller  42.0    m
b       NaN   NaN  NaN
c       all  36.0    f

In [41]:
df.iloc[0:3, 1:4]

  last_name   age  sex
a    miller  42.0    m
b       NaN   NaN  NaN
c       all  36.0    f

In [42]:
df.loc['c':, 'sex':]

  sex  pretestscore  posttestscore
c   f           NaN            NaN
d   m           2.0           62.0
e   f           3.0           70.0

In [43]:
df.iloc[2:, 3:]

  sex  pretestscore  posttestscore
c   f           NaN            NaN
d   m           2.0           62.0
e   f           3.0           70.0

In [44]:
df

  first_name last_name   age  sex  pretestscore  posttestscore
a      jason    miller  42.0    m           4.0           25.0
b        NaN       NaN   NaN  NaN           NaN            NaN
c       tina       all  36.0    f           NaN            NaN
d       jake     miler  24.0    m           2.0           62.0
e        amy    coozer  73.0    f           3.0           70.0

In [45]:
# all, miler, NaN, 2.0

In [46]:
df.loc['c':'d', 'last_name'::3]

  last_name  pretestscore
c       all           NaN
d     miler           2.0

In [47]:
df.loc['c':'d', ['last_name', 'pretestscore']]

  last_name  pretestscore
c       all           NaN
d     miler           2.0

In [48]:
### 'age'가 40 이상인 사람의 이름을 추출..
df[df['age'] > 40]['last_name'].values.tolist()

['miller', 'coozer']

In [49]:
## 'jason'의 prestestscore는 얼마인가?

In [50]:
df[df['first_name'] == 'jason']['pretestscore']

a    4.0
Name: pretestscore, dtype: float64

In [51]:
# 여성의 평균 나이..
import numpy as np
np.mean(df[df['sex'] == 'f']['age'].values)

54.5

In [52]:
df[df['sex'] == 'f']['age'].mean()

54.5

In [53]:
# 최고령자의 이름...

In [54]:
df[df['age'] == df['age'].max()][['first_name','last_name', 'age']]

  first_name last_name   age
e        amy    coozer  73.0

In [55]:
df

  first_name last_name   age  sex  pretestscore  posttestscore
a      jason    miller  42.0    m           4.0           25.0
b        NaN       NaN   NaN  NaN           NaN            NaN
c       tina       all  36.0    f           NaN            NaN
d       jake     miler  24.0    m           2.0           62.0
e        amy    coozer  73.0    f           3.0           70.0

#### Column 추가

In [56]:
df

  first_name last_name   age  sex  pretestscore  posttestscore
a      jason    miller  42.0    m           4.0           25.0
b        NaN       NaN   NaN  NaN           NaN            NaN
c       tina       all  36.0    f           NaN            NaN
d       jake     miler  24.0    m           2.0           62.0
e        amy    coozer  73.0    f           3.0           70.0

In [57]:
df['addr'] = ['seoul','incheon','gwangju','pusan','seoul']

In [58]:
df['age'] = [42,25,78,41,23]
df

  first_name last_name  age  sex  pretestscore  posttestscore     addr
a      jason    miller   42    m           4.0           25.0    seoul
b        NaN       NaN   25  NaN           NaN            NaN  incheon
c       tina       all   78    f           NaN            NaN  gwangju
d       jake     miler   41    m           2.0           62.0    pusan
e        amy    coozer   23    f           3.0           70.0    seoul

In [59]:
df.iloc[1,3] = 'f'
df

  first_name last_name  age sex  pretestscore  posttestscore     addr
a      jason    miller   42   m           4.0           25.0    seoul
b        NaN       NaN   25   f           NaN            NaN  incheon
c       tina       all   78   f           NaN            NaN  gwangju
d       jake     miler   41   m           2.0           62.0    pusan
e        amy    coozer   23   f           3.0           70.0    seoul

In [60]:
df.rename(columns={'first_name':'fn', 'last_name':'ln'}, inplace=True)

In [61]:
df

      fn      ln  age sex  pretestscore  posttestscore     addr
a  jason  miller   42   m           4.0           25.0    seoul
b    NaN     NaN   25   f           NaN            NaN  incheon
c   tina     all   78   f           NaN            NaN  gwangju
d   jake   miler   41   m           2.0           62.0    pusan
e    amy  coozer   23   f           3.0           70.0    seoul

In [62]:
df.columns = ['fn','ln','age','sex','prets','postts', 'addr']
df

      fn      ln  age sex  prets  postts     addr
a  jason  miller   42   m    4.0    25.0    seoul
b    NaN     NaN   25   f    NaN     NaN  incheon
c   tina     all   78   f    NaN     NaN  gwangju
d   jake   miler   41   m    2.0    62.0    pusan
e    amy  coozer   23   f    3.0    70.0    seoul

In [63]:
df

      fn      ln  age sex  prets  postts     addr
a  jason  miller   42   m    4.0    25.0    seoul
b    NaN     NaN   25   f    NaN     NaN  incheon
c   tina     all   78   f    NaN     NaN  gwangju
d   jake   miler   41   m    2.0    62.0    pusan
e    amy  coozer   23   f    3.0    70.0    seoul

In [64]:
df.drop('addr', axis=1, inplace=True)

In [65]:
df.drop('b', inplace=True)

In [66]:
df

      fn      ln  age sex  prets  postts
a  jason  miller   42   m    4.0    25.0
c   tina     all   78   f    NaN     NaN
d   jake   miler   41   m    2.0    62.0
e    amy  coozer   23   f    3.0    70.0

In [67]:
df.to_csv('test.csv')

In [68]:
pd.read_csv('test.csv', index_col=0)

      fn      ln  age sex  prets  postts
a  jason  miller   42   m    4.0    25.0
c   tina     all   78   f    NaN     NaN
d   jake   miler   41   m    2.0    62.0
e    amy  coozer   23   f    3.0    70.0

#### 결측치 처리

In [69]:
np.random.rand(5,3)

array([[0.75881607, 0.46893015, 0.55160664],
       [0.54227699, 0.88086586, 0.3664386 ],
       [0.46182237, 0.05214632, 0.41020065],
       [0.34451031, 0.01520183, 0.98462884],
       [0.60659876, 0.19903532, 0.75297652]])

In [70]:
df = pd.DataFrame(np.random.rand(5,5), columns = ['one','two',\
            'three','four','five'], index = ['a','b','c','d','e'])
df

        one       two     three      four      five
a  0.967511  0.109917  0.343033  0.790264  0.825791
b  0.913097  0.414119  0.201153  0.557758  0.441703
c  0.334327  0.840230  0.804629  0.508892  0.848715
d  0.746463  0.716741  0.537281  0.867785  0.794386
e  0.547249  0.072497  0.122964  0.741162  0.728807

In [71]:
df.iloc[1:3, 1] = np.nan
df.iloc[2, 2:4] = np.nan
df

        one       two     three      four      five
a  0.967511  0.109917  0.343033  0.790264  0.825791
b  0.913097       NaN  0.201153  0.557758  0.441703
c  0.334327       NaN       NaN       NaN  0.848715
d  0.746463  0.716741  0.537281  0.867785  0.794386
e  0.547249  0.072497  0.122964  0.741162  0.728807

In [72]:
df.isnull()

     one    two  three   four   five
a  False  False  False  False  False
b  False   True  False  False  False
c  False   True   True   True  False
d  False  False  False  False  False
e  False  False  False  False  False

In [73]:
df.isnull().sum(axis=0)

one      0
two      2
three    1
four     1
five     0
dtype: int64

In [74]:
df.isnull().sum(axis=1)

a    0
b    1
c    3
d    0
e    0
dtype: int64

In [75]:
# null값 처리
# 1. null값을 포함한 행이나 컬럼을 삭제 => dropna()
# 2. null값을 다른 값으로 대체 => fillna()

In [76]:
df.dropna()

        one       two     three      four      five
a  0.967511  0.109917  0.343033  0.790264  0.825791
d  0.746463  0.716741  0.537281  0.867785  0.794386
e  0.547249  0.072497  0.122964  0.741162  0.728807

In [77]:
df.dropna(axis=1)

        one      five
a  0.967511  0.825791
b  0.913097  0.441703
c  0.334327  0.848715
d  0.746463  0.794386
e  0.547249  0.728807

In [78]:
df.dropna(how='all')

        one       two     three      four      five
a  0.967511  0.109917  0.343033  0.790264  0.825791
b  0.913097       NaN  0.201153  0.557758  0.441703
c  0.334327       NaN       NaN       NaN  0.848715
d  0.746463  0.716741  0.537281  0.867785  0.794386
e  0.547249  0.072497  0.122964  0.741162  0.728807

In [79]:
df.dropna(thresh=3)

        one       two     three      four      five
a  0.967511  0.109917  0.343033  0.790264  0.825791
b  0.913097       NaN  0.201153  0.557758  0.441703
d  0.746463  0.716741  0.537281  0.867785  0.794386
e  0.547249  0.072497  0.122964  0.741162  0.728807

In [80]:
df.fillna(0.35)

        one       two     three      four      five
a  0.967511  0.109917  0.343033  0.790264  0.825791
b  0.913097  0.350000  0.201153  0.557758  0.441703
c  0.334327  0.350000  0.350000  0.350000  0.848715
d  0.746463  0.716741  0.537281  0.867785  0.794386
e  0.547249  0.072497  0.122964  0.741162  0.728807

In [81]:
df.fillna(method='ffill')

        one       two     three      four      five
a  0.967511  0.109917  0.343033  0.790264  0.825791
b  0.913097  0.109917  0.201153  0.557758  0.441703
c  0.334327  0.109917  0.201153  0.557758  0.848715
d  0.746463  0.716741  0.537281  0.867785  0.794386
e  0.547249  0.072497  0.122964  0.741162  0.728807

In [82]:
df.fillna(method='bfill')

        one       two     three      four      five
a  0.967511  0.109917  0.343033  0.790264  0.825791
b  0.913097  0.716741  0.201153  0.557758  0.441703
c  0.334327  0.716741  0.537281  0.867785  0.848715
d  0.746463  0.716741  0.537281  0.867785  0.794386
e  0.547249  0.072497  0.122964  0.741162  0.728807

In [83]:
df

        one       two     three      four      five
a  0.967511  0.109917  0.343033  0.790264  0.825791
b  0.913097       NaN  0.201153  0.557758  0.441703
c  0.334327       NaN       NaN       NaN  0.848715
d  0.746463  0.716741  0.537281  0.867785  0.794386
e  0.547249  0.072497  0.122964  0.741162  0.728807

In [84]:
np.random.rand(5)

array([0.50321572, 0.38061992, 0.36932175, 0.8811446 , 0.31798614])

In [85]:
np.random.randn(5)

array([-0.20415463,  1.67419551, -0.95672165,  0.65624527, -0.28913253])

In [86]:
np.random.randint(1, 11, 10)

array([ 1,  6,  6,  5,  3,  5, 10,  1,  3,  1])

In [87]:
np.random.choice([1,2,3,4,5])

2

In [88]:
np.random.sample((5))

array([0.74046636, 0.36756418, 0.03362608, 0.6161201 , 0.36552942])